# Case Study on Measures of Central Tendency and Dispersion

In [1]:
# An Institution wishes to find out their student’s ability in maths, reading and writing skills.
# The Institution wants to do an exploratory study to check the following information.

In [2]:
# Read the students_performance dataset to the python environment

In [3]:
# Importing the required libraries

import pandas as pd
import numpy as np

In [4]:
# Loading the CSV file into a pandas dataframe.

data= pd.read_csv(r'C:\ict\Assignments\3 case study 2\StudentsPerformance.csv')

In [5]:
data

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group C,some high school,free/reduced,none,0,17,10
1,female,group B,high school,free/reduced,none,8,24,23
2,female,group B,some high school,free/reduced,none,18,32,28
3,female,group B,some college,standard,none,11,38,32
4,female,group C,some college,free/reduced,none,22,39,33
...,...,...,...,...,...,...,...,...
995,male,group E,some college,standard,completed,99,87,81
996,male,group A,some college,standard,completed,100,96,86
997,male,group D,some college,standard,completed,100,97,99
998,male,group E,associate's degree,free/reduced,completed,100,100,93
999,male,group E,bachelor's degree,standard,completed,100,100,100

# 1. Find out how many males and females participated in the test.

In [6]:
gender=data.groupby(["gender"]).count()

In [7]:
gender

,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
gender,,,,,,,
female,518,518,518,518,518,518,518
male,482,482,482,482,482,482,482

In [8]:
# Number of males participated in the test is 482
# Number of females participated in the test is 518

# 2. What do you think about the students' parental level of education?

In [9]:
data1=data.groupby(["parental level of education"]).count()

In [10]:
data1

,gender,race/ethnicity,lunch,test preparation course,math score,reading score,writing score
parental level of education,,,,,,,
associate's degree,222,222,222,222,222,222,222
bachelor's degree,118,118,118,118,118,118,118
high school,196,196,196,196,196,196,196
master's degree,59,59,59,59,59,59,59
some college,226,226,226,226,226,226,226
some high school,179,179,179,179,179,179,179

In [11]:
# Insights

# Parents having some college level of education is more in number compared to other levels
# Associate's degree comes 2nd ,high school level 3rd position
# Some high school level 4th postion ,Bachelor's degree 5th position
# Very less number of parents having master's degree

# 3. Who scores the most on average for math, reading and writing based on
● Gender
● Test preparation course

# Gender

In [12]:
gender_scores=data.groupby(["gender"]).mean()

In [13]:
gender_scores

        math score  reading score  writing score
gender
female   63.376448      72.590734      72.467181
male     68.821577      65.545643      63.446058

In [17]:
# Maths Score
# Male students scored highest

# Reading Score
# Female students scored highest

# Writing Score
# Female students scored highest

# Test preparation course

In [18]:
Test_preparation_course=data.groupby(["test preparation course"]).mean()

In [19]:
Test_preparation_course

                         math score  reading score  writing score
test preparation course
completed                  69.96648      74.175978      74.684358
none                       63.78972      66.417445      64.457944

In [ ]:
# The students who completed test preparation course scored the most

# 4. What do you think about the scoring variation for math, reading and writing
based on
● Gender
● Test preparation course

# Gender

In [20]:
data_gender=data.groupby(["gender"]).std()

In [21]:
data_gender

        math score  reading score  writing score
gender
female   16.029928      14.411018      14.844842
male     14.556411      14.149594      14.227225

In [ ]:
# The scoring variation for math, reading and writing is more for female students
# Male students are consistent.

# Test preparation course

In [22]:
data_Test_preparation_course=data.groupby(["test preparation course"]).std()

In [23]:
data_Test_preparation_course

                         math score  reading score  writing score
test preparation course
completed                 14.521847      13.537572      13.236412
none                      15.705689      14.608896      15.041667

In [ ]:
# Students who completed the test preperation course are more consistent

# 5. The management needs your help to give bonus points to the top 25% of students based on their maths score, so how will you help the management to achieve this.
.

In [ ]:
# Top 25% students comes under 3rd Quartile.

In [24]:
# To find top 25% of students based on their maths score.
Third_quartile=np.quantile(data['math score'],0.75)

In [25]:
Third_quartile

77.0

In [ ]:
# Students having maths score higher than 77.0 comes top 25%

In [26]:
Third_Quartile_number=data[data['math score']>=Third_quartile].count()

In [27]:
Third_Quartile_number

gender                         255
race/ethnicity                 255
parental level of education    255
lunch                          255
test preparation course        255
math score                     255
reading score                  255
writing score                  255
dtype: int64

In [ ]:
# The management needs to give bonus points to 255 students
# Who scored the top 25%  on their maths score